<a href="https://colab.research.google.com/github/alamin19/Descriptive-Analytics-of-Health-data/blob/main/Descriptive_Analytics.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np 
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.metrics import roc_auc_score
%matplotlib inline

# 4.1 Descriptive Analytics of Health data

# a) Read the csv file and display (report) the first five rows. Also, list the columns present in the csv file.

In [ ]:
df = pd.read_csv("CDCbirths.csv") # loading data as pandas dataframe

In [ ]:
df.head() # print first 5 rows

   year  month  day gender  births
0  1969      1  1.0      F    4046
1  1969      1  1.0      M    4440
2  1969      1  2.0      F    4454
3  1969      1  2.0      M    4548
4  1969      1  3.0      F    4548

In [ ]:
for each in df.columns: # print name of the columns in the dataset
    print(each)

year
month
day
gender
births

# b) Add a decade column, and obtain the male and female births as a function of decade (i.e., Fill in the following table)

In [ ]:
df["decade"]=10*(df["year"]//10) # making decade from years
table = pd.pivot_table(df, values='births', index=['decade'], columns=['gender'], aggfunc=np.sum) # filling the table using pivot table 

table

gender         F         M
decade
1960     1753634   1846572
1970    16263075  17121550
1980    18310351  19243452
1990    19479454  20420553
2000    18229309  19106428